Revit 2024 API
AnalysisDisplayColorEntry Constructor (Color)
 Constructs a color entry with no value assigned.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayColorEntry(
	Color color
)
Visual Basic
Public Sub New ( _
	color As Color _
)
Visual C++
public:
AnalysisDisplayColorEntry(
	Color^ color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
 Color assigned to the entry.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisDisplayColorEntry Class
AnalysisDisplayColorEntry Overload
Autodesk.Revit.DB.Analysis Namespace